In [1]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import getpass 

#Claadataanalyst2023

In [2]:
password = getpass.getpass()

········

In [3]:
bd = "Sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/Sakila)

In [4]:
from sqlalchemy import text 

with engine.connect() as connection:
    query = text('SELECT * from actor')
    result = connection.execute(query)
result

In [5]:
row = result.first()

In [6]:
row

(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33))

Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved.

In [18]:
def rentals_month (engine, month = 5, year = 2005):
    with engine.connect() as connection:
        query = text(f'''
        SELECT 
            year(rental_date) as year,
            month(rental_date) as month,
            customer_id
        FROM
        rental
        Where month(rental_date) = {month} AND year(rental_date) ={year};
        '''          )
        result = connection.execute(query)
        df = pd.DataFrame(result.all())
    return df

In [19]:
rentals_month(engine,5,2005)

      year  month  customer_id
0     2005      5          130
1     2005      5          459
2     2005      5          408
3     2005      5          333
4     2005      5          222
...    ...    ...          ...
1151  2005      5          506
1152  2005      5           59
1153  2005      5          251
1154  2005      5          106
1155  2005      5           61

[1156 rows x 3 columns]

Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

In [23]:
def rental_count_month_3(engine,month=5,year=2005):
    if isinstance(month,(int,float)) and isinstance(year,(int,float)):
        month = int(month)
        year = int(year)
        with engine.connect() as connection:
            query= f'''SELECT 
                        customer_id,
                        count(*) as rentals_{month}_{year}
                    FROM
                    rental
                    WHERE month(rental_date)={month} and year(rental_date)={year}
                    GROUP BY customer_id'''
            df = pd.read_sql(query,con=connection) 
        return df
    else:
        print('Month and year should be numeric!')

In [28]:
df1=rental_count_month_3(engine)
df2=rental_count_month_3(engine,month=8)

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [29]:
def compare_rentals(first_dataframe,second_dataframe):
    df_merged = pd.merge(first_dataframe,second_dataframe,how='outer').fillna(0)
    df_merged['difference'] = df_merged.iloc[:,2] - df_merged.iloc[:,1]
    return df_merged

In [30]:
compare_rentals(df1,df2)

     customer_id  rentals_5_2005  rentals_8_2005  difference
0              1             2.0              11         9.0
1              2             1.0              11        10.0
2              3             2.0               7         5.0
3              5             3.0              13        10.0
4              6             3.0              12         9.0
..           ...             ...             ...         ...
594          583             0.0               5         5.0
595          585             0.0               6         6.0
596          591             0.0               9         9.0
597          592             0.0               8         8.0
598          598             0.0               5         5.0

[599 rows x 4 columns]